'use strict';
(function (angular) {
    angular.module('ngt4edu.portal.generalactivities')
        .controller('generalactivitiespageCtrl', ['$scope', '$stateParams', generalactivitiespageCtrl]);
    function generalactivitiespageCtrl($scope, $stateParams) {
                   
        $scope.pageTitle = "الأنشطة الطلابية";
        document.title = "عين الإثرائية - " + $scope.pageTitle;
        $scope.pageDescription = "انطلاقًا من الأهداف الاستراتيجية لوزارة التعليم في برنامج التحوّل الوطني ودورها في تحسين البيئة التعليمية المحفزة للإبداع والابتكار، وتطوير المناهج وأساليب التعليم والتقويم. جاءت مبادرة مركز تطوير تعليم العلوم والتقنية والهندسة والرياضيات (مركز STEM) كأحد مبادرات وزارة التعليم في برنامج التحول الوطني، وانطلقت فكرة إنشاء هذا المركز تحقيقا لرؤية المملكة العربية السعودية 2030 في التحول من اقتصاد أحادي إلى اقتصاد مزدهر متنوع المصادر، وتعزيز مبدأ التعلّم لأجل العمل عبر تزويد أبناؤنا بالمهارات اللازمة لوظائف المستقبل، وتوجيه الطلاب نحو الخيارات الوظيفية والمهنية المناسبة. وتحقيق المملكة لمرتبة متقدمة في تنافسية الاقتصادات المعرفية والصناعية، ولذا تبنى المركز منحى STEM  التعليمي لتطوير تعليم العلوم والتقنية والهندسة والرياضيات كآلية فاعلة للتصدي لضعف مخرجات التعليم في التخصصات الأربع بشكلها المنفرد ، وتقديمها في سياقات مفيدة تربط بين المدرسة والمجتمع وسوق العمل والمؤسسات العالمية ، والقدرة على المنافسة في الاقتصاد المعرفي والصناعي.وضمن خطة مركز تطوير تعليم العلوم والتقنية والهندسة والرياضيات في تفعيل مراكز STEM المدرسية ونشر ثقافة منهجية تعليم STEM في الميدان التربوي.قام المركز وبتنفيذ من شركة تطوير التعليمية ببناء وتصميم  56 حقيبة تعليمية و60 درساً نموذجيا في مجالات العلوم والرياضيات لجميع المراحل التعليمية ، كما تم انتاج 16 فيلماً توعوياً في مجالات تعليم STEM المختلفة وتطبيقاته المتنوعة والتوجهات الحديثة في مجال دمج التقنية في التعليم وربط وتكامل المفاهيم العلمية للعلوم المختلفة بواقع الحياة ومتطلبات التنمية وحاجة سوق العمل وريادة الأعمال.";
        $('meta[name=description]').attr('content', $scope.pageDescription);

        $scope.categoryId = 0;
        $scope.categoryId = $stateParams.categoryId;
              
    }
})(angular);